In [1]:
import pandas as pd

In [3]:
insurance_details = pd.read_csv('insurance.csv')
insurance_details

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [4]:
insurance_details['region'].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

### 7.1 Display the average Insurance charges based on regions

In [8]:
insurance_details.groupby(by='region')['charges'].mean().round().sort_values(ascending = False)

region
southeast    14735.0
northeast    13406.0
northwest    12418.0
southwest    12347.0
Name: charges, dtype: float64

### 7.2 Display the average Insurance charges based on regions and gender

In [10]:
insurance_details.groupby(by=['region','sex'])['charges'].mean().round().sort_values(ascending = False)

region     sex
southeast  male      15880.0
northeast  male      13854.0
southeast  female    13500.0
southwest  male      13413.0
northeast  female    12953.0
northwest  female    12480.0
           male      12354.0
southwest  female    11274.0
Name: charges, dtype: float64

In [12]:
pd.pivot_table(data = insurance_details, values='charges',index='region',columns='sex',aggfunc = 'mean').round()

sex         female     male
region
northeast  12953.0  13854.0
northwest  12480.0  12354.0
southeast  13500.0  15880.0
southwest  11274.0  13413.0

In [18]:
pd.crosstab(index = insurance_details['region'],columns = insurance_details['sex'],margins = True)
## By default,computes a frequency table of the factors

sex        female  male   All
region
northeast     161   163   324
northwest     164   161   325
southeast     175   189   364
southwest     162   163   325
All           662   676  1338

# THE END!!!!